In [1]:
import pandas as pd

In [2]:
df_movies = pd.read_csv('IMDb movies.csv', low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [3]:
# seleccionar columnas
df_movies = df_movies[['imdb_title_id', 'title', 'year',
                       'genre', 'country']]

df_ratings = df_ratings[['imdb_title_id', 'total_votes', 'mean_vote']]

# merge()

In [4]:
df1 = pd.DataFrame({'id': ['A', 'B', 'C', 'D'],
                    'age': [30, 23, 25, 22]})
df2 = pd.DataFrame({'id': ['C', 'D', 'E', 'F'],
                    'job': ['Doctor', 'Statistician',
                            'Accountant', 'Developer']})

In [9]:
df1.head(3)

  id  age
0  A   30
1  B   23
2  C   25

In [10]:
df2.head(3)

  id           job
0  C        Doctor
1  D  Statistician
2  E    Accountant

##  Left join

In [37]:
df1.merge(df2, on='id', how='left')

  id  age           job
0  A   30           NaN
1  B   23           NaN
2  C   25        Doctor
3  D   22  Statistician

### Ejercicio

In [ ]:
# extraer 50% muestra de df_movies (nombrarlo df_movies_sample)

In [ ]:
# hacer merge entre df_movies_sample y df_ratings (left join)

In [ ]:
# shape

## Exclusive Left join

In [45]:
df1.merge(df2, on='id', how='outer')

  id   age           job
0  A  30.0           NaN
1  B  23.0           NaN
2  C  25.0        Doctor
3  D  22.0  Statistician
4  E   NaN    Accountant
5  F   NaN     Developer

In [46]:
# indicator=True
df1.merge(df2, on='id', how='outer', indicator=True)

  id   age           job      _merge
0  A  30.0           NaN   left_only
1  B  23.0           NaN   left_only
2  C  25.0        Doctor        both
3  D  22.0  Statistician        both
4  E   NaN    Accountant  right_only
5  F   NaN     Developer  right_only

In [47]:
# query
df1.merge(df2, on='id', how='outer',
          indicator=True).query("_merge=='left_only'")

  id   age  job     _merge
0  A  30.0  NaN  left_only
1  B  23.0  NaN  left_only

### Ejercicio

In [ ]:
# hacer copia de dataframe df_movies (nombrarlo df_movies_2)

In [ ]:
# fijar primeros 1000 valores de columna 'imdb_title_id' el valor de 'tt1234567890'

In [ ]:
# hacer merge entre df_movies_2 y df_ratings (exclusive left join)

In [ ]:
# shape